UKS/src/Documents/ПриказКомандировки/ПриказКомандировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриказКомандировки</name>
  <attributes>
    <name>ДатаПриказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПриказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписываетПриказ</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриказСПродлением</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуточнаяНормаВыплатВодителю</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыбранныеПриказы</name>
    <attributes>
      <name>НазваниеКомандировки</name>
      <type>
        <types>DocumentRef.КомандировочноеУдостоверение</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыплатаВодителю</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СВозвращением</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СчитатьРабочимиДнями</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыходныеНачало</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РабочиеНачало</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыходныеОкончание</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РабочиеОкончание</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВОднодневнуюКомандировку</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПродлениеПоДату</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

UKS/src/Documents/ПриказКомандировки/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура РаспечататьПриказ(Команда)
	ПараметрыПолей = ПараметрыПолейНаСервере();	
	Результат = УправлениеПечатьюСервер.ПечататьКомандировкуПриказ(ПараметрыПолей);
	УправлениеПечатьюКлиентСервер.ДокументПоказать(Результат,3);
КонецПроцедуры

&НаСервере 
Функция  ПараметрыПолейНаСервере()
	ПарметрыПолей = Новый Структура;
	
	ВыбраныйПриказ = Элементы.Список.ВыделенныеСтроки;
	Для Каждого Стр Из ВыбраныйПриказ Цикл
		СсылкаНаКоманди = Стр;
	КонецЦикла;
	Кол = СсылкаНаКоманди.ВыбранныеПриказы.Количество();
	СтрокаПриказКаманд = "";
	СтрокаСотрудник = "";
	СтрокаСВодителем = "";
	итерТекст = 1;
	итерОбзац = 1;
	колсимволов = 0;
	итерКо = 0;
	итерСо = 0;	
	КолВоди = 0;
	
	ТекстНомераПриказа = Формат(СсылкаНаКоманди.ДатаПриказа, "ДФ=dd.MM.yyyy")+ "г. № "+СсылкаНаКоманди.НомерПриказа;
	
	ПарметрыПолей.Вставить("НомерПриказа0", ТекстНомераПриказа);
	
	Пока итерКо < Кол цикл
	   	
		Командир = СсылкаНаКоманди.ВыбранныеПриказы[итерКо].НазваниеКомандировки;
		
		ТекстВступления = "";
		ТекстПодежаОтВида = "";
		Если Не СсылкаНаКоманди.НомерПриказа = Командир.НомерПриказа Тогда
			
			ТекстВступления = "Продлить командировку (приказ о командировании " + Командир.НомерПриказа +" от " + Формат(Командир.ДатаПриказа, "ДЛФ=DD")  + ") ";
			ТекстПодежаОтВида = "ПД=Дательный";
		Иначе 
		    ТекстВступления = "Командировать " ;
			ТекстПодежаОтВида = "ПД=Винительный";
		КонецЕсли;
		
		колСо = Командир.ГруппаРаботников.Количество();
		Пока итерСо < колСо Цикл

			пол = "ПЛ=Мужской";
			ПолПоОтчеству = Прав(СокрП(Командир.ГруппаРаботников[итерСо].ФИОполное.ПолноеНаименование),2);
			Если ПолПоОтчеству = "ич" Тогда
				Пол = "ПЛ=Мужской";
			ИначеЕсли ПолПоОтчеству = "на" Тогда
				Пол = "ПЛ=Женский";
			КонецЕсли;
			
			КоличествоСклонений = ПолучитьСклоненияСтроки(Командир.ГруппаРаботников[итерСо].ФИОполное.Наименование,Пол,ТекстПодежаОтВида).Количество();
			НомерПриСклонении = 0;
			Если КоличествоСклонений > 1 Тогда
				НомерПриСклонении = 1;
			КонецЕсли;
			
			парам = "" + ПолучитьСклоненияСтроки(Нрег(Командир.ГруппаРаботников[итерСо].ФИОполное.Должность),Пол,ТекстПодежаОтВида)[0] + " " + ПолучитьСклоненияСтроки(Командир.ГруппаРаботников[итерСо].ФИОполное.Наименование,Пол,ТекстПодежаОтВида)[НомерПриСклонении] ;
			ПоискВодитель =Найти(парам, "водите");
			Если ПоискВодитель > 0 Тогда
				СтрокаСВодителем = ПолучитьСклоненияСтроки( Командир.ГруппаРаботников[итерСо].ФИОполное.Наименование,,"ПД=Дательный")[НомерПриСклонении];
				КолВоди = КолВоди + 1;
			КонецЕсли;
			СтрокаСотрудник = СтрокаСотрудник + парам + ", ";               
			итерСо = итерСо + 1;	
		КонецЦикла;
		
		СтрокаСотрудник = Лев(СтрокаСотрудник,СтрДлина(СтрокаСотрудник)-2);
		
		Позиция = Найти(СтрокаСотрудник, "Водителя");
		ТекстНачалаИОкончанияКомандировки = "";
		
		Если Командир.НомерПриказа = СсылкаНаКоманди.НомерПриказа Тогда 
			КоличествоДнейПриПродлениии = Командир.КоличествоДней;
			
			Если Командир.КоличествоДней = 1 тогда
				ТекстНачалаИОкончанияКомандировки = " " + Формат(Командир.ОкончаниеКомандировки, "ДФ='дд ММММ гггг'; ДЛФ=DD") + " г.";
			ИначеЕсли НачалоМесяца(Командир.НачалоКомандировки) = НачалоМесяца(Командир.ОкончаниеКомандировки)  Тогда 
				ТекстНачалаИОкончанияКомандировки = " с " + Формат(Командир.НачалоКомандировки, "ДФ=дд") + " по " + Формат(Командир.ОкончаниеКомандировки, "ДФ='дд ММММ гггг'; ДЛФ=DD") + " г.";
			ИначеЕсли НачалоГода(Командир.НачалоКомандировки) = НачалоГода(Командир.ОкончаниеКомандировки)  Тогда 
				ТекстНачалаИОкончанияКомандировки = " с " + Формат(Командир.НачалоКомандировки, "ДФ='дд ММММ'; ДЛФ=DD") + " по " + Формат(Командир.ОкончаниеКомандировки, "ДФ='дд ММММ гггг'; ДЛФ=DD") + " г.";
			Иначе
				ТекстНачалаИОкончанияКомандировки = " с " + Формат(Командир.НачалоКомандировки, "ДФ='дд ММММ гггг'; ДЛФ=DD") + " г." + " по " + Формат(Командир.ОкончаниеКомандировки, "ДФ='дд ММММ гггг'; ДЛФ=DD") + " г.";
			КонецЕсли;
		Иначе 
			
			
			КоДнДляМод = ((Командир.ОкончаниеКомандировки - СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ПродлениеПоДату)/86400); 
			КоличествоДнейПриПродлениии = Макс(КоДнДляМод,-КоДнДляМод);
			
			ТекстНачалаИОкончанияКомандировки = " по " + Формат(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ПродлениеПоДату, "ДФ='дд ММММ гггг'; ДЛФ=DD") + " г.";
			
		КонецЕсли;
		
		Если СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВОднодневнуюКомандировку = Истина Тогда 
			КомандироватьВОднодневную = "в однодневную командировку ";
		ИначеЕсли СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВОднодневнуюКомандировку = Ложь Тогда
			КомандироватьВОднодневную = "";
		КонецЕсли;
		
		СтрокаПриказКаманд = СтрокаПриказКаманд + ТекстВступления + КомандироватьВОднодневную + СтрокаСотрудник + " в " + Командир.КудаКомандировать + " для " +
		Командир.ЦельКомандировки.ПолноеНаименование + " на " 	+ ПолучитьСклоненияСтрокиПоЧислу("день", КоличествоДнейПриПродлениии,,,"ПД=Именительный")[0] + ТекстНачалаИОкончанияКомандировки;
		
		СуточнаяНорма = " " + ПолучитьСклоненияСтрокиПоЧислу("рубль", СсылкаНаКоманди.СуточнаяНормаВыплатВодителю)[0] + ".";
		
		Если КолВоди > 0 И СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыплатаВодителю И СсылкаНаКоманди.ВыбранныеПриказы[итерКо].СВозвращением Тогда
			СтрокаПриказКаманд =СтрокаПриказКаманд+ " с ежедневным возвращением к месту жительства." + " Общая выплата водителю " + СтрокаСВодителем + " составляет в сутки" + СуточнаяНорма;	
		ИначеЕсли КолВоди > 0 И СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыплатаВодителю  Тогда
			СтрокаПриказКаманд = СтрокаПриказКаманд+ " Общая выплата водителю " + СтрокаСВодителем + " составляет в сутки" + СуточнаяНорма;
			КолВоди = 0;
		ИначеЕсли СсылкаНаКоманди.ВыбранныеПриказы[итерКо].СВозвращением Тогда 		
			СтрокаПриказКаманд =СтрокаПриказКаманд+ " с ежедневным возвращением к месту жительства.";
		КонецЕсли;
		
		// Если дни командировки выпадают на выходной день то он переносится на рабочий день
		Если СсылкаНаКоманди.ВыбранныеПриказы[итерКо].СчитатьРабочимиДнями = Истина Тогда
			
			Если Не СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеНачало = Дата(1,1,1) Или Не СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеОкончание = Дата(1,1,1) Тогда
				
				//Количество рабочих дней
				Если СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеНачало = Дата(1,1,1) Или  СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеОкончание = Дата(1,1,1) Тогда 
					МодульЧисла = 1;
				Иначе 
					КоличествоДней = (НачалоДня(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеОкончание) - НачалоДня(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеНачало))/(60*60*24);
					МодульЧисла = ?(КоличествоДней > 0, КоличествоДней, -КоличествоДней)+1;
				КонецЕсли;
				
				ВыходныеДни = "";
				
				РабочиеДни = "";
				ТекстДаты = "";
				//Текст промежутка между датами 
				Если МодульЧисла > 2 Тогда
					ТекстДаты = " по "
				Иначе 
					ТекстДаты = " и ";
				КонецЕсли;
				
				// Рабочие
				// Рабочий один день
				Если МодульЧисла = 1 тогда
					Если СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеОкончание = Дата(1,1,1)
						Или СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеОкончание = СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеНачало Тогда
						
						РабочиеДни = " " + Формат(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеНачало, "ДФ='дд ММММ'; ДЛФ=DD") + " рабочим днем";
						
					ИначеЕсли СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеНачало = Дата(1,1,1) Тогда
						
						РабочиеДни = " " + Формат(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеОкончание, "ДФ='дд ММММ'; ДЛФ=DD") + " рабочим днем";
					КонецЕсли;
				//Рабочий в приделах одного месяца	
				ИначеЕсли НачалоМесяца(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеНачало) = НачалоМесяца(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеОкончание)  Тогда 
					
					РабочиеДни = " " + Формат(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеНачало, "ДФ=дд") + ТекстДаты + Формат(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеОкончание, "ДФ='дд ММММ'; ДЛФ=DD") + " рабочими днями";
				//Рабочие в пределах одного года 	
				ИначеЕсли НачалоГода(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеНачало) = НачалоГода(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеОкончание)  Тогда 
					
					РабочиеДни = " " + Формат(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеНачало, "ДФ='дд ММММ'; ДЛФ=DD") + ТекстДаты + Формат(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеОкончание, "ДФ='дд ММММ'; ДЛФ=DD") + " рабочими днями";
				//Рабочние дни между годами	
				ИначеЕсли Не НачалоГода(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеНачало) = НачалоГода(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеОкончание)  Тогда 
					
					РабочиеДни = " " + Формат(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеНачало, "ДФ='дд ММММ гггг'; ДЛФ=DD")+" г." + ТекстДаты + Формат(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеОкончание, "ДФ='дд ММММ гггг'; ДЛФ=DD") + " г." + " рабочими днями";
					
				КонецЕсли;
				
				//Количество выходных дней 
				Если СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеНачало = Дата(1,1,1) Или  СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеОкончание = Дата(1,1,1) Тогда 
					МодульЧисла = 1;
				Иначе 
					КоличествоДней = (НачалоДня(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеОкончание) - НачалоДня(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеНачало))/(60*60*24);
					МодульЧисла = ?(КоличествоДней > 0, КоличествоДней, -КоличествоДней)+1;
				КонецЕсли;
				
				// Выходные
				// Выходной по требованию рабочего
				Если СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеНачало = Дата(1,1,1) И СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеОкончание = Дата(1,1,1) Тогда
					Если МодульЧисла = 1 Тогда 
						ВыходныеДни = " выходного дня по заявлению работников.";	
					Иначе 
						ВыходныеДни = " выходных дней по заявлению работников.";	
					КонецЕсли;
				Иначе
					// Выходной один день 
					Если МодульЧисла = 1 И (СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеНачало = Дата(1,1,1) Или СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеОкончание = Дата(1,1,1)
						Или СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеНачало = СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеОкончание) Тогда 
						
						Если СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеОкончание = Дата(1,1,1) Или СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеНачало = СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеОкончание Тогда
							
							ВыходныеДни = " выходного дня " + Формат(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеНачало, "ДФ='дд ММММ гггг';ДЛФ=DD")  + " г.";
							
						ИначеЕсли СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеНачало = Дата(1,1,1) Тогда
							
							ВыходныеДни = " выходного дня " + Формат(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеОкончание, "ДФ='дд ММММ гггг'; ДЛФ=DD") + " г.";
						КонецЕсли;
					// Выходные дни в пределах месяца	
					ИначеЕсли НачалоМесяца(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеНачало) = НачалоМесяца(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеОкончание)  Тогда 
						
						ВыходныеДни = " выходных дней " + Формат(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеНачало, "ДФ=дд") + ТекстДаты + Формат(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеОкончание, "ДФ='дд ММММ гггг'; ДЛФ=DD") + " г.";
					// Выходные дни в пределах года	
					ИначеЕсли НачалоГода(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеНачало) = НачалоГода(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеОкончание)  Тогда 
						
						ВыходныеДни = " выходных дней " + Формат(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеНачало, "ДФ='дд ММММ'; ДЛФ=DD") + ТекстДаты + Формат(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеОкончание, "ДФ='дд ММММ гггг'; ДЛФ=DD") + " г.";
					// Выходные дни между годами 	
					ИначеЕсли Не НачалоГода(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеНачало) = НачалоГода(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеОкончание)  Тогда 
						
						ВыходныеДни = " выходных дней " + Формат(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеНачало, "ДФ='дд ММММ гггг'; ДЛФ=DD")+" г." + ТекстДаты + Формат(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеОкончание, "ДФ='дд ММММ гггг'; ДЛФ=DD") + " г.";
						
					КонецЕсли;
				КонецЕсли;
				
				СтрокаПриказКаманд = СтрокаПриказКаманд + " Считать" + РабочиеДни  + ", с предоставлением" + ВыходныеДни;
				
			Иначе
				
				Сообщить("Не выбранна дата начала рабочих дней");
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если итерКо < Кол-1 Тогда
			СтрокаПриказКаманд = СтрокаПриказКаманд + Символ(94) + Символ(112);
		КонецЕсли;
		
		итерКо = итерКо+1;
		итерСо = 0; 
		СтрокаСотрудник = "";
		КолВоди = 0;
	КонецЦикла;
                
	СтрокаПриказКаманд = СтрЗаменить(СтрокаПриказКаманд,"i","I"); 
	СтрокаПриказКаманд =  Документы.ПриказКомандировки.ЗаменаКавычек(СтрокаПриказКаманд);

	//КолВоди = 0;
	ТекстВводаВорд = "";
	НачальныйНомерСимвола = 0;
	КоличесвоОтобранныхСимволов = 255;
	Пока итерОбзац < 41 Цикл
	
		СтрокаДляВводаВВорд = Сред(СтрокаПриказКаманд,НачальныйНомерСимвола,КоличесвоОтобранныхСимволов);
		
		Если Лев(СтрокаДляВводаВВорд,1) = " " Тогда
			СтрокаДляВводаВВорд = Сред(СтрокаПриказКаманд,НачальныйНомерСимвола,КоличесвоОтобранныхСимволов - 1);
			НачальныйНомерСимвола = НачальныйНомерСимвола+254;
		ИначеЕсли Прав(СтрокаДляВводаВВорд,1) = Символ(94) Тогда
			СтрокаДляВводаВВорд = Сред(СтрокаПриказКаманд,НачальныйНомерСимвола,КоличесвоОтобранныхСимволов - 1);
			НачальныйНомерСимвола = НачальныйНомерСимвола+254;

		ИначеЕсли Прав(СтрокаДляВводаВВорд,1) = "“" Тогда
			СтрокаДляВводаВВорд = Сред(СтрокаПриказКаманд,НачальныйНомерСимвола,КоличесвоОтобранныхСимволов);
			НачальныйНомерСимвола = НачальныйНомерСимвола+255; 
		Иначе
			НачальныйНомерСимвола = НачальныйНомерСимвола+255; 
		КонецЕсли;
		
		ПарметрыПолей.Вставить("Кого" + итерОбзац, СтрокаДляВводаВВорд);
		
		Если  итерОбзац = 1 Тогда
			НачальныйНомерСимвола = НачальныйНомерСимвола + 1;
		КонецЕсли;
		
		итерОбзац = итерОбзац + 1;

	КонецЦикла;
	
	ПарметрыПолей.Вставить("ДолжностьН", СсылкаНаКоманди.ПодписываетПриказ.Должность.Наименование);
	ПарметрыПолей.Вставить("ФИОН",СсылкаНаКоманди.ПодписываетПриказ.Наименование);	
	
	Возврат ПарметрыПолей;
	
КонецФункции

&НаСервере
Процедура ДатаОтбораПриИзмененииНаСервере()
	ОтборПоДате();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОтбораПриИзменении(Элемент)
	ДатаОтбораПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтборПоДате() 
	Если Не ЗначениеЗаполнено(ДатаОтбора.ДатаНачала) Тогда
		ОбщегоНазначенияНаСервере.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список,"Дата",);		
	Иначе
		МассивДат = Новый Массив;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриказКомандировки.Дата КАК Дата
		|ИЗ
		|	Документ.ПриказКомандировки КАК ПриказКомандировки
		|ГДЕ
		|	ПриказКомандировки.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
		
		Запрос.УстановитьПараметр("ДатаНачала", ДатаОтбора.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания", ДатаОтбора.ДатаОкончания); 		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи2 = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи2.Следующий() Цикл
			МассивДат.Добавить(ВыборкаДетальныеЗаписи2.Дата);
		КонецЦикла;
		
		
		ОбщегоНазначенияНаСервере.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список,"Дата",);				
		ОбщегоНазначенияНаСервере.УстановитьЭлементОтбораДинамическогоСписка(Список,"Дата",МассивДат,,,Истина,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный,);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Обнова()
	ОтборПоДате();
	ОповеститьОбИзменении(Тип("ДокументСсылка.ПриказКомандировки"));
	ОповеститьОбИзменении(Тип("ДокументСсылка.КомандировочноеУдостоверение"));
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
         
	ПодключитьОбработчикОжидания("Обнова", 30, Ложь);

КонецПроцедуры

&НаСервере
Процедура СписокПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	//Раджолтр = Элемент;
	//
	//
	//Если Элемент.ТекущаяСтрока = Истина Тогда
	//	ыва = 2;
	//КонецЕсли;
	//
	//СписокПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПриказ(Команда)
	ТаблДок = ПечатьПриказаНаСервере();
	ТаблДок.ОтображатьСетку = Ложь;
	ТаблДок.АвтоМасштаб = Истина;
	ТаблДок.ТолькоПросмотр = Истина;
	ТаблДок.МасштабПечати = 100;
	ТаблДок.ПолеСлева=15;
	ТаблДок.ОтображатьЗаголовки = Ложь; 
	ТаблДок.Показать("Приказ");
КонецПроцедуры

&НаСервере
Функция ПечатьПриказаНаСервере()
	
	ВыбраныйПриказ = Элементы.Список.ВыделенныеСтроки;
	Для Каждого Стр Из ВыбраныйПриказ Цикл
		СсылкаНаКоманди = Стр;
	КонецЦикла;
	
	ТаблДок = Новый ТабличныйДокумент;
	Макет = Документы.ПриказКомандировки.ПолучитьМакет("Приказ");
	Шапка = Макет.ПолучитьОбласть("ЗаголовокПриказа");
	
	ТекстНомераПриказа = Формат(СсылкаНаКоманди.ДатаПриказа, "ДФ=dd.MM.yyyy")+ "г. № "+СсылкаНаКоманди.НомерПриказа;

	Шапка.Параметры.НомерПриказа0 = ТекстНомераПриказа;
	ТаблДок.Вывести(Шапка);
	ТекстПриказ = Макет.ПолучитьОбласть("ОсновнойТекст");
	
	Кол = СсылкаНаКоманди.ВыбранныеПриказы.Количество();
	СтрокаПриказКаманд = "";
	СтрокаСотрудник = "";
	СтрокаСВодителем = "";
	итерТекст = 1;
	итерОбзац = 1;
	итерКо = 0;
	итерСо = 0;	
	КолВоди = 0;
	
		
		Пока итерКо < Кол цикл
	   	
		Командир = СсылкаНаКоманди.ВыбранныеПриказы[итерКо].НазваниеКомандировки;
		колСо = Командир.ГруппаРаботников.Количество();
		Пока итерСо < колСо Цикл
			
			пол = "ПЛ=Мужской";
			ПолПоОтчеству = Прав(СокрП(Командир.ГруппаРаботников[итерСо].ФИОполное.ПолноеНаименование),2);
			Если ПолПоОтчеству = "ич" Тогда
				Пол = "ПЛ=Мужской";
			ИначеЕсли ПолПоОтчеству = "на" Тогда
				Пол = "ПЛ=Женский";
			КонецЕсли;
			
			КоличествоСклонений = ПолучитьСклоненияСтроки(Командир.ГруппаРаботников[итерСо].ФИОполное.Наименование,Пол,"ПД=Винительный").Количество();
			НомерПриСклонении = 0;
			Если КоличествоСклонений > 1 Тогда
				НомерПриСклонении = 1;
			КонецЕсли;
			
			парам = "" + ПолучитьСклоненияСтроки(Нрег(Командир.ГруппаРаботников[итерСо].ФИОполное.Должность),Пол,"ПД=Винительный")[0] + " " + ПолучитьСклоненияСтроки(Командир.ГруппаРаботников[итерСо].ФИОполное.Наименование,Пол,"ПД=Винительный")[НомерПриСклонении] ;
			ПоискВодитель =Найти(парам, "водите");
			Если ПоискВодитель > 0 Тогда
				СтрокаСВодителем = ПолучитьСклоненияСтроки( Командир.ГруппаРаботников[итерСо].ФИОполное.Наименование,,"ПД=Дательный")[НомерПриСклонении];
				КолВоди = КолВоди +1;
			КонецЕсли;
			СтрокаСотрудник = СтрокаСотрудник + парам + ", ";               
			//+ ПолучитьСклоненияСтроки( "Серышев Н.В.",,"ПД=Винительный")[0] + ", ";
			итерСо = итерСо + 1;	
		КонецЦикла;
		
		СтрокаСотрудник = Лев(СтрокаСотрудник,СтрДлина(СтрокаСотрудник)-2);
		
		Командир = СсылкаНаКоманди.ВыбранныеПриказы[итерКо].НазваниеКомандировки;
		
		ТекстВступления = "";
		ТекстПодежаОтВида = "";
		Если Не СсылкаНаКоманди.НомерПриказа = Командир.НомерПриказа Тогда
			
			ТекстВступления = "Продлить командировку (приказ о командировании " + Командир.НомерПриказа +" от " + Формат(Командир.ДатаПриказа, "ДЛФ=DD")  + ") ";
			ТекстПодежаОтВида = "ПД=Дательный";
		Иначе 
		    ТекстВступления = "Командировать " ;
			ТекстПодежаОтВида = "ПД=Винительный";
		КонецЕсли;
		
		колСо = Командир.ГруппаРаботников.Количество();
		Пока итерСо < колСо Цикл

			пол = "ПЛ=Мужской";
			ПолПоОтчеству = Прав(СокрП(Командир.ГруппаРаботников[итерСо].ФИОполное.ПолноеНаименование),2);
			Если ПолПоОтчеству = "ич" Тогда
				Пол = "ПЛ=Мужской";
			ИначеЕсли ПолПоОтчеству = "на" Тогда
				Пол = "ПЛ=Женский";
			КонецЕсли;
			
			КоличествоСклонений = ПолучитьСклоненияСтроки(Командир.ГруппаРаботников[итерСо].ФИОполное.Наименование,Пол,ТекстПодежаОтВида).Количество();
			НомерПриСклонении = 0;
			Если КоличествоСклонений > 1 Тогда
				НомерПриСклонении = 1;
			КонецЕсли;
			
			парам = "" + ПолучитьСклоненияСтроки(Нрег(Командир.ГруппаРаботников[итерСо].ФИОполное.Должность),Пол,ТекстПодежаОтВида)[0] + " " + ПолучитьСклоненияСтроки(Командир.ГруппаРаботников[итерСо].ФИОполное.Наименование,Пол,ТекстПодежаОтВида)[НомерПриСклонении] ;
			ПоискВодитель =Найти(парам, "водите");
			Если ПоискВодитель > 0 Тогда
				СтрокаСВодителем = ПолучитьСклоненияСтроки( Командир.ГруппаРаботников[итерСо].ФИОполное.Наименование,,"ПД=Дательный")[НомерПриСклонении];
				КолВоди = КолВоди + 1;
			КонецЕсли;
			СтрокаСотрудник = СтрокаСотрудник + парам + ", ";               
			итерСо = итерСо + 1;	
		КонецЦикла;
		
		СтрокаСотрудник = Лев(СтрокаСотрудник,СтрДлина(СтрокаСотрудник)-2);
		
		Позиция = Найти(СтрокаСотрудник, "Водителя");
		ТекстНачалаИОкончанияКомандировки = "";
		
		Если Командир.НомерПриказа = СсылкаНаКоманди.НомерПриказа Тогда 
			КоличествоДнейПриПродлениии = Командир.КоличествоДней;
			
			Если Командир.КоличествоДней = 1 тогда
				ТекстНачалаИОкончанияКомандировки = " " + Формат(Командир.ОкончаниеКомандировки, "ДФ='дд ММММ гггг'; ДЛФ=DD") + " г.";
			ИначеЕсли НачалоМесяца(Командир.НачалоКомандировки) = НачалоМесяца(Командир.ОкончаниеКомандировки)  Тогда 
				ТекстНачалаИОкончанияКомандировки = " с " + Формат(Командир.НачалоКомандировки, "ДФ=дд") + " по " + Формат(Командир.ОкончаниеКомандировки, "ДФ='дд ММММ гггг'; ДЛФ=DD") + " г.";
			ИначеЕсли НачалоГода(Командир.НачалоКомандировки) = НачалоГода(Командир.ОкончаниеКомандировки)  Тогда 
				ТекстНачалаИОкончанияКомандировки = " с " + Формат(Командир.НачалоКомандировки, "ДФ='дд ММММ'; ДЛФ=DD") + " по " + Формат(Командир.ОкончаниеКомандировки, "ДФ='дд ММММ гггг'; ДЛФ=DD") + " г.";
			Иначе
				ТекстНачалаИОкончанияКомандировки = " с " + Формат(Командир.НачалоКомандировки, "ДФ='дд ММММ гггг'; ДЛФ=DD") + " г." + " по " + Формат(Командир.ОкончаниеКомандировки, "ДФ='дд ММММ гггг'; ДЛФ=DD") + " г.";
			КонецЕсли;
		Иначе 
			
			
			КоДнДляМод = ((Командир.ОкончаниеКомандировки - СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ПродлениеПоДату)/86400); 
			КоличествоДнейПриПродлениии = Макс(КоДнДляМод,-КоДнДляМод);
			
			ТекстНачалаИОкончанияКомандировки = " по " + Формат(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ПродлениеПоДату, "ДФ='дд ММММ гггг'; ДЛФ=DD") + " г.";
			
		КонецЕсли;
		
		Если СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВОднодневнуюКомандировку = Истина Тогда 
			КомандироватьВОднодневную = "в однодневную командировку ";
		ИначеЕсли СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВОднодневнуюКомандировку = Ложь Тогда
			КомандироватьВОднодневную = "";
		КонецЕсли;
		
		СтрокаПриказКаманд = СтрокаПриказКаманд + ТекстВступления + КомандироватьВОднодневную + СтрокаСотрудник + " в " + Командир.КудаКомандировать + " для " +
		Командир.ЦельКомандировки.ПолноеНаименование + " на " 	+ ПолучитьСклоненияСтрокиПоЧислу("день", КоличествоДнейПриПродлениии,,,"ПД=Именительный")[0] + ТекстНачалаИОкончанияКомандировки;
		
		СуточнаяНорма = " " + ПолучитьСклоненияСтрокиПоЧислу("рубль", СсылкаНаКоманди.СуточнаяНормаВыплатВодителю)[0] + ".";
		
		Если КолВоди > 0 И СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыплатаВодителю И СсылкаНаКоманди.ВыбранныеПриказы[итерКо].СВозвращением Тогда
			СтрокаПриказКаманд =СтрокаПриказКаманд+ " с ежедневным возвращением к месту жительства." + " Общая выплата водителю " + СтрокаСВодителем + " составляет в сутки" + СуточнаяНорма;	
		ИначеЕсли КолВоди > 0 И СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыплатаВодителю  Тогда
			СтрокаПриказКаманд = СтрокаПриказКаманд+ " Общая выплата водителю " + СтрокаСВодителем + " составляет в сутки" + СуточнаяНорма;
			КолВоди = 0;
		ИначеЕсли СсылкаНаКоманди.ВыбранныеПриказы[итерКо].СВозвращением Тогда 		
			СтрокаПриказКаманд =СтрокаПриказКаманд+ " с ежедневным возвращением к месту жительства.";
		КонецЕсли;
		
		// Если дни командировки выпадают на выходной день то он переносится на рабочий день
		Если СсылкаНаКоманди.ВыбранныеПриказы[итерКо].СчитатьРабочимиДнями = Истина Тогда
			
			Если Не СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеНачало = Дата(1,1,1) Или Не СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеОкончание = Дата(1,1,1) Тогда
				
				//Количество рабочих дней
				Если СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеНачало = Дата(1,1,1) Или  СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеОкончание = Дата(1,1,1) Тогда 
					МодульЧисла = 1;
				Иначе 
					КоличествоДней = (НачалоДня(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеОкончание) - НачалоДня(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеНачало))/(60*60*24);
					МодульЧисла = ?(КоличествоДней > 0, КоличествоДней, -КоличествоДней)+1;
				КонецЕсли;
				
				ВыходныеДни = "";
				
				РабочиеДни = "";
				ТекстДаты = "";
				//Текст промежутка между датами 
				Если МодульЧисла > 2 Тогда
					ТекстДаты = " по "
				Иначе 
					ТекстДаты = " и ";
				КонецЕсли;
				
				// Рабочие
				// Рабочий один день
				Если МодульЧисла = 1 тогда
					Если СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеОкончание = Дата(1,1,1)
						Или СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеОкончание = СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеНачало Тогда
						
						РабочиеДни = " " + Формат(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеНачало, "ДФ='дд ММММ'; ДЛФ=DD") + " рабочим днем";
						
					ИначеЕсли СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеНачало = Дата(1,1,1) Тогда
						
						РабочиеДни = " " + Формат(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеОкончание, "ДФ='дд ММММ'; ДЛФ=DD") + " рабочим днем";
					КонецЕсли;
				//Рабочий в приделах одного месяца	
				ИначеЕсли НачалоМесяца(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеНачало) = НачалоМесяца(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеОкончание)  Тогда 
					
					РабочиеДни = " " + Формат(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеНачало, "ДФ=дд") + ТекстДаты + Формат(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеОкончание, "ДФ='дд ММММ'; ДЛФ=DD") + " рабочими днями";
				//Рабочие в пределах одного года 	
				ИначеЕсли НачалоГода(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеНачало) = НачалоГода(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеОкончание)  Тогда 
					
					РабочиеДни = " " + Формат(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеНачало, "ДФ='дд ММММ'; ДЛФ=DD") + ТекстДаты + Формат(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеОкончание, "ДФ='дд ММММ'; ДЛФ=DD") + " рабочими днями";
				//Рабочние дни между годами	
				ИначеЕсли Не НачалоГода(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеНачало) = НачалоГода(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеОкончание)  Тогда 
					
					РабочиеДни = " " + Формат(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеНачало, "ДФ='дд ММММ гггг'; ДЛФ=DD")+" г." + ТекстДаты + Формат(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].РабочиеОкончание, "ДФ='дд ММММ гггг'; ДЛФ=DD") + " г." + " рабочими днями";
					
				КонецЕсли;
				
				//Количество выходных дней 
				Если СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеНачало = Дата(1,1,1) Или  СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеОкончание = Дата(1,1,1) Тогда 
					МодульЧисла = 1;
				Иначе 
					КоличествоДней = (НачалоДня(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеОкончание) - НачалоДня(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеНачало))/(60*60*24);
					МодульЧисла = ?(КоличествоДней > 0, КоличествоДней, -КоличествоДней)+1;
				КонецЕсли;
				
				// Выходные
				// Выходной по требованию рабочего
				Если СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеНачало = Дата(1,1,1) И СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеОкончание = Дата(1,1,1) Тогда
					Если МодульЧисла = 1 Тогда 
						ВыходныеДни = " выходного дня по заявлению работников.";	
					Иначе 
						ВыходныеДни = " выходных дней по заявлению работников.";	
					КонецЕсли;
				Иначе
					// Выходной один день 
					Если МодульЧисла = 1 И (СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеНачало = Дата(1,1,1) Или СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеОкончание = Дата(1,1,1)
						Или СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеНачало = СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеОкончание) Тогда 
						
						Если СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеОкончание = Дата(1,1,1) Или СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеНачало = СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеОкончание Тогда
							
							ВыходныеДни = " выходного дня " + Формат(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеНачало, "ДФ='дд ММММ гггг';ДЛФ=DD")  + " г.";
							
						ИначеЕсли СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеНачало = Дата(1,1,1) Тогда
							
							ВыходныеДни = " выходного дня " + Формат(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеОкончание, "ДФ='дд ММММ гггг'; ДЛФ=DD") + " г.";
						КонецЕсли;
					// Выходные дни в пределах месяца	
					ИначеЕсли НачалоМесяца(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеНачало) = НачалоМесяца(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеОкончание)  Тогда 
						
						ВыходныеДни = " выходных дней " + Формат(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеНачало, "ДФ=дд") + ТекстДаты + Формат(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеОкончание, "ДФ='дд ММММ гггг'; ДЛФ=DD") + " г.";
					// Выходные дни в пределах года	
					ИначеЕсли НачалоГода(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеНачало) = НачалоГода(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеОкончание)  Тогда 
						
						ВыходныеДни = " выходных дней " + Формат(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеНачало, "ДФ='дд ММММ'; ДЛФ=DD") + ТекстДаты + Формат(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеОкончание, "ДФ='дд ММММ гггг'; ДЛФ=DD") + " г.";
					// Выходные дни между годами 	
					ИначеЕсли Не НачалоГода(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеНачало) = НачалоГода(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеОкончание)  Тогда 
						
						ВыходныеДни = " выходных дней " + Формат(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеНачало, "ДФ='дд ММММ гггг'; ДЛФ=DD")+" г." + ТекстДаты + Формат(СсылкаНаКоманди.ВыбранныеПриказы[итерКо].ВыходныеОкончание, "ДФ='дд ММММ гггг'; ДЛФ=DD") + " г.";
						
					КонецЕсли;
				КонецЕсли;
				
				СтрокаПриказКаманд = СтрокаПриказКаманд + " Считать" + РабочиеДни  + ", с предоставлением" + ВыходныеДни;
				
			Иначе
				
				Сообщить("Не выбранна дата начала рабочих дней");
				
			КонецЕсли;
			
		КонецЕсли;
		
               
	СтрокаПриказКаманд = СтрЗаменить(СтрокаПриказКаманд,"i","I"); 
	СтрокаПриказКаманд =  Документы.ПриказКомандировки.ЗаменаКавычек(СтрокаПриказКаманд); 

		ТекстПриказ.Параметры.НомерСтроки = "" + итерОбзац + ".";
		ТекстПриказ.Параметры.ТекстПриказа = СтрокаПриказКаманд;
		ТаблДок.Вывести(ТекстПриказ);  
		СтрокаПриказКаманд = "";
		итерОбзац = итерОбзац + 1;
		итерКо = итерКо+1;
		итерСо = 0; 
		СтрокаСотрудник = "";
		КолВоди = 0;
	КонецЦикла;


	Подвал = Макет.ПолучитьОбласть("НачальникФИО");
	Подвал.Параметры.ДолжностьН = СсылкаНаКоманди.ПодписываетПриказ.Должность.Наименование;
	Подвал.Параметры.ФИОН = СсылкаНаКоманди.ПодписываетПриказ.Наименование;
	ТаблДок.Вывести(Подвал);
	Возврат ТаблДок;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КлиентПользователя = "";
	ПолучитьКлиентПользователя(КлиентПользователя);
	
	Если КлиентПользователя = "Веб-клиент" Тогда
		Элементы.ФормаРаспечататьПриказ.Видимость = Ложь;
	КонецЕсли;
	ДатаОтбора.ДатаНачала = НачалоГода(ТекущаяДата());
	ДатаОтбора.ДатаОкончания = КонецГода(ТекущаяДата());
	ОтборПоДате(); 
КонецПроцедуры

&НаСервере
Функция ПолучитьКлиентПользователя(ИмяПриложения)
	НомерСоединения  = НомерСоединенияИнформационнойБазы();
	
	СеансыИБ = ПолучитьСеансыИнформационнойБазы();        
    Для Каждого Сеанс Из СеансыИБ Цикл         
        Если Сеанс.НомерСоединения = НомерСоединения Тогда
				ИмяПриложения = ПредставлениеПриложения(Сеанс.ИмяПриложения); 
        КонецЕсли;   
    КонецЦикла;
	Возврат ИмяПриложения;
КонецФункции
